Revit 2027 API
ParameterTypeId.RbsElecEnclosure Property
 "Enclosure"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecEnclosure { get; }
Public Shared ReadOnly Property RbsElecEnclosure As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecEnclosure {
	ForgeTypeId^ get ();
}
static member RbsElecEnclosure : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace